<div class="flex w-full">
    <div class="relative flex w-full flex-col">
        <main class="flex-auto">
            <div class="sm:px-8 mt-16 sm:mt-32">
                <div class="mx-auto w-full max-w-7xl lg:px-8">
                    <div class="relative px-4 sm:px-8 lg:px-12">
                        <div class="mx-auto max-w-2xl lg:max-w-5xl">
                            <div class="grid grid-cols-1 gap-y-16 lg:grid-cols-2 lg:grid-rows-[auto_1fr] lg:gap-y-12">
                                <div class="lg:pl-20">
                                    <div class="max-w-xs px-2.5 lg:max-w-none"><img alt="" loading="lazy" width="800"
                                            height="800" decoding="async" data-nimg="1"
                                            class="aspect-square rotate-3 rounded-2xl bg-zinc-100 object-cover dark:bg-zinc-800"
                                            style="color:transparent" sizes="(min-width: 1024px) 32rem, 20rem"
                                            srcSet="./images/about_me.jpeg" src="./images/about_me.jpeg" />
                                    </div>
                                </div>
                                <div class="lg:order-first lg:row-span-2">
                                    <h1
                                        class="text-4xl font-bold tracking-tight text-zinc-800 dark:text-zinc-100 sm:text-5xl">
                                        I’m Son I. I live in shinshiro, Work in Seibishi.</h1>
                                    <div class="mt-6 space-y-7 text-base text-zinc-600 dark:text-zinc-400">
                                        <p>僕はこの仕事をやるのが日本に来る前にいっさい想像はなかった。そもそも、最初日本に来て留学するのも想像だけだった。だけど、なんだかのきっかけに、バカ短に留学することになった。僕バカ短入る前に、車接したこともなかった。そもそも日本に来たくて来たくて、こういう強い気持ちの方が、正直にいえば僕がバカ短に入る理由じゃないでしょうか。学校で当たり前の２年はものすごく早くて終わった。学校にいた間、何があったか今でもはっきり覚えていない。その間に、必死にバイトして、貯金したお金で自動車学校を通った。免許取る費用は中古軽自動車一台ぐらいのお値段です。さすがにビックリしました。学校卒業した後、次は北海道に
                                        </p>
                                        <p>面接した時に、どこでもいいかに聞かれて、その後派遣場所は北海道になった。行ったことがないところやっぱり外国人の俺にとってすごく新鮮感がある。今までの仕事とは違って、やっぱ最初からすごく大変だった。体力もないし、日本語を聞き取るのも弱いし、なかなか上手く仕事に行かない状態だった。２週間後洗車の人がやめてから、僕なかなか中の作業を追いつかな買ったので、洗車場に流放された。洗車場を初めて、俺に車の運転をやらさせました。最初やっぱ短距離で車の移動でもすごく時間かかったが、半年ぐらい乗って、ちょっとだけ上手くなって、どんどん車の移動を僕に、当時中の一人が免許停止の処分で、僕はその人が車を移動したい時に、手伝いに行く形になった。たぶん俺のことを嫌いので、最初決めたルールは二人一緒に作業する形にしたかったが、なかなかうまく行ってなかった。その後また洗車場に流放された。こうして働いてる間に、僕は考えました。こうするのが一年まだいいけど、ずっとこのままで行くと、将来はすごく不安になる。こういう考えの中で、僕は命をかけても行かないといけない信念が生じた。そして転職を決めた。
                                        </p>
                                        <p>転職だけど、僕あんまり特徴とかないじゃん、じゃあ僕はどうやって転職できるかと思っていた。転職先もどうやって見つけるかなかなか悩んでいた。ある日に学校のホームページを見て、いろんな卒業した留学生がどこの会社に入った自己紹介みたいな情報を見つけて、じゃあ俺もそうしようかと頭の中にこういう考えた。次に俺の考えは他の人よりもっとできることがあれば、転職が一層できる可能性にも増えるじゃん。そうして俺自分のホームページを作ってみた。ホームページの上に自分に関する情報も乗って、自分がいくつ選択した会社に送った（たしかに三つの会社だった）。それだけじゃなくて、もっと俺が他の人より優秀的そうに見られるのが大事なポイントで、また日本語テストのトップ１級を参加しに行った。合格したけど、そのテストの内容は聞き取りの能力とか、話することができるのがあんまり関係はなくて、書くテストだけで、やっぱり実際に身につけるのが難しい。その後はカローラ愛知（今の会社）に入った。これ結構長い話です。また考えたら、書いて補充します。
                                        </p>
                                        <p>カローラ愛知に入った。今の会社です。すでに半年以上に経って、自分の能力不足なのでできることまた少なくて、またたまたますごく怖いことをしたりする（ぼく常識的なことでも備えていない）。同僚さんの勧誘の下で、ついに車も買いました。自分の車で弄って練習して、これからいろいろも頑張らないといけないです。自分のためも。
                                        </p>
                                        <p>
                                            前のfly.ioの無料のやつ(Dockerはやったことないがないから、しかもすごく遅いし（Dockerは全然遅くないけど、fly.ioのの無料サービス遅い、しかもデータベースも無料なやつを使って、たまたま自動で寝るモードになっちゃう）)を使ったが、諦めて、aws（これでも無料だけど、性能の方がすごく良いから、一応パソコンだから）の方にしました。またまた何もできていないから、これからいろんな機能を追加します。
                                        </p>

                                        <p>
                                            来年の夢と頑張りたいことは
                                        </p>
                                        <ul class="list-outside hover:list-inside">
                                            <li>１.れいかさんとけっこんする。</li>
                                            <li>２.今年よりも仕事ができるように、首にならないように頑張ってやっていく。</li>
                                            <li>３.事故ならないように。</li>
                                        </ul>
                                    </div>
                                </div>
                                <div class="lg:pl-20">
                                    <ul role="list">
                                        <li class="flex"><a
                                                class="group flex text-sm font-medium text-zinc-800 transition hover:text-teal-500 dark:text-zinc-200 dark:hover:text-teal-500"
                                                href="javascript:alert('tsuita nai')"><svg viewBox="0 0 24 24"
                                                    aria-hidden="true"
                                                    class="h-6 w-6 flex-none fill-zinc-500 transition group-hover:fill-teal-500">
                                                    <path
                                                        d="M20.055 7.983c.011.174.011.347.011.523 0 5.338-3.92 11.494-11.09 11.494v-.003A10.755 10.755 0 0 1 3 18.186c.308.038.618.057.928.058a7.655 7.655 0 0 0 4.841-1.733c-1.668-.032-3.13-1.16-3.642-2.805a3.753 3.753 0 0 0 1.76-.07C5.07 13.256 3.76 11.6 3.76 9.676v-.05a3.77 3.77 0 0 0 1.77.505C3.816 8.945 3.288 6.583 4.322 4.737c1.98 2.524 4.9 4.058 8.034 4.22a4.137 4.137 0 0 1 1.128-3.86A3.807 3.807 0 0 1 19 5.274a7.657 7.657 0 0 0 2.475-.98c-.29.934-.9 1.729-1.713 2.233A7.54 7.54 0 0 0 22 5.89a8.084 8.084 0 0 1-1.945 2.093Z">
                                                    </path>
                                                </svg><span class="ml-4">Follow on Twitter</span></a></li>
                                        <li class="mt-4 flex"><a
                                                class="group flex text-sm font-medium text-zinc-800 transition hover:text-teal-500 dark:text-zinc-200 dark:hover:text-teal-500"
                                                href="https://www.instagram.com/caicaicaizi2?igsh=YzAwZjE1ZTI0Zg=="
                                                target="_blank"><svg viewBox="0 0 24 24" aria-hidden="true"
                                                    class="h-6 w-6 flex-none fill-zinc-500 transition group-hover:fill-teal-500">
                                                    <path
                                                        d="M12 3c-2.444 0-2.75.01-3.71.054-.959.044-1.613.196-2.185.418A4.412 4.412 0 0 0 4.51 4.511c-.5.5-.809 1.002-1.039 1.594-.222.572-.374 1.226-.418 2.184C3.01 9.25 3 9.556 3 12s.01 2.75.054 3.71c.044.959.196 1.613.418 2.185.23.592.538 1.094 1.039 1.595.5.5 1.002.808 1.594 1.038.572.222 1.226.374 2.184.418C9.25 20.99 9.556 21 12 21s2.75-.01 3.71-.054c.959-.044 1.613-.196 2.185-.419a4.412 4.412 0 0 0 1.595-1.038c.5-.5.808-1.002 1.038-1.594.222-.572.374-1.226.418-2.184.044-.96.054-1.267.054-3.711s-.01-2.75-.054-3.71c-.044-.959-.196-1.613-.419-2.185A4.412 4.412 0 0 0 19.49 4.51c-.5-.5-1.002-.809-1.594-1.039-.572-.222-1.226-.374-2.184-.418C14.75 3.01 14.444 3 12 3Zm0 1.622c2.403 0 2.688.009 3.637.052.877.04 1.354.187 1.67.31.421.163.72.358 1.036.673.315.315.51.615.673 1.035.123.317.27.794.31 1.671.043.95.052 1.234.052 3.637s-.009 2.688-.052 3.637c-.04.877-.187 1.354-.31 1.67-.163.421-.358.72-.673 1.036a2.79 2.79 0 0 1-1.035.673c-.317.123-.794.27-1.671.31-.95.043-1.234.052-3.637.052s-2.688-.009-3.637-.052c-.877-.04-1.354-.187-1.67-.31a2.789 2.789 0 0 1-1.036-.673 2.79 2.79 0 0 1-.673-1.035c-.123-.317-.27-.794-.31-1.671-.043-.95-.052-1.234-.052-3.637s.009-2.688.052-3.637c.04-.877.187-1.354.31-1.67.163-.421.358-.72.673-1.036.315-.315.615-.51 1.035-.673.317-.123.794-.27 1.671-.31.95-.043 1.234-.052 3.637-.052Z">
                                                    </path>
                                                    <path
                                                        d="M12 15a3 3 0 1 1 0-6 3 3 0 0 1 0 6Zm0-7.622a4.622 4.622 0 1 0 0 9.244 4.622 4.622 0 0 0 0-9.244Zm5.884-.182a1.08 1.08 0 1 1-2.16 0 1.08 1.08 0 0 1 2.16 0Z">
                                                    </path>
                                                </svg><span class="ml-4">Follow on Instagram</span></a></li>
                                        <li class="mt-4 flex"><a
                                                class="group flex text-sm font-medium text-zinc-800 transition hover:text-teal-500 dark:text-zinc-200 dark:hover:text-teal-500"
                                                target="_blank" href="https://github.com/mmasdas/"><svg
                                                    viewBox="0 0 24 24" aria-hidden="true"
                                                    class="h-6 w-6 flex-none fill-zinc-500 transition group-hover:fill-teal-500">
                                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                                        d="M12 2C6.475 2 2 6.588 2 12.253c0 4.537 2.862 8.369 6.838 9.727.5.09.687-.218.687-.487 0-.243-.013-1.05-.013-1.91C7 20.059 6.35 18.957 6.15 18.38c-.113-.295-.6-1.205-1.025-1.448-.35-.192-.85-.667-.013-.68.788-.012 1.35.744 1.538 1.051.9 1.551 2.338 1.116 2.912.846.088-.666.35-1.115.638-1.371-2.225-.256-4.55-1.14-4.55-5.062 0-1.115.387-2.038 1.025-2.756-.1-.256-.45-1.307.1-2.717 0 0 .837-.269 2.75 1.051.8-.23 1.65-.346 2.5-.346.85 0 1.7.115 2.5.346 1.912-1.333 2.75-1.05 2.75-1.05.55 1.409.2 2.46.1 2.716.637.718 1.025 1.628 1.025 2.756 0 3.934-2.337 4.806-4.562 5.062.362.32.675.936.675 1.897 0 1.371-.013 2.473-.013 2.82 0 .268.188.589.688.486a10.039 10.039 0 0 0 4.932-3.74A10.447 10.447 0 0 0 22 12.253C22 6.588 17.525 2 12 2Z">
                                                    </path>
                                                </svg><span class="ml-4">Follow on GitHub</span></a></li>
                                        <li class="mt-8 border-t border-zinc-100 pt-8 dark:border-zinc-700/40 flex">
                                            <a class="group flex text-sm font-medium text-zinc-800 transition hover:text-teal-500 dark:text-zinc-200 dark:hover:text-teal-500"
                                                href="mailto:luoli6860@gmail.com"><svg viewBox="0 0 24 24"
                                                    aria-hidden="true"
                                                    class="h-6 w-6 flex-none fill-zinc-500 transition group-hover:fill-teal-500">
                                                    <path fill-rule="evenodd"
                                                        d="M6 5a3 3 0 0 0-3 3v8a3 3 0 0 0 3 3h12a3 3 0 0 0 3-3V8a3 3 0 0 0-3-3H6Zm.245 2.187a.75.75 0 0 0-.99 1.126l6.25 5.5a.75.75 0 0 0 .99 0l6.25-5.5a.75.75 0 0 0-.99-1.126L12 12.251 6.245 7.187Z">
                                                    </path>
                                                </svg><span class="ml-4">luoli6860@gmail.com</span></a>
                                        </li>
                                    </ul>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </main>
    </div>
</div>